app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "user_name", "post_id") VALUES ($1, $2, $3) RETURNING "id"  [["content", "ayy"], ["user_name", "mo"], ["post_id", 1]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["post_id", 1], ["id", 4]]
---
  def edit
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["post_id", 4], ["id", 1]]
UPDATE "comments" SET "content" = $1 WHERE "comments"."id" = $2  [["content", "JOPE"], ["id", 1]]
---
  def update
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.update(comment_params)