app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @comments = Comment.all
---
SELECT "posts".* FROM "posts"
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def create
    @post = Post.create!(post_params)
---
INSERT INTO "posts" ("title", "content", "user_name") VALUES ($1, $2, $3) RETURNING "id"  [["title", "turbans"], ["content", "the turbanator"], ["user_name", "mo"]]

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "content" = $1 WHERE "posts"."id" = $2  [["content", "Roses are Red\r\nViolets are Blue\r\nLayla's a beauty \r\ni'm sure you think so too"], ["id", 2]]